app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
---
  def index
    if params[:author_id]
      author = Author.find(params[:author_id])
      @posts = author.posts
    else
      @posts = Post.all