app/controllers/posts_controller.rb

  def index
    if params[:author_id]
      @posts = Author.find_by(params[:author_id]).posts
    else
      @posts = Post.all
---
SELECT "authors".* FROM "authors"